## Staging: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                |
|----------|--------------------------------------------------------------------|
| add      | `module.gh_oidc_roles.aws_iam_role.this[&quot;OIDCGithubWorkflowRole&quot;]` |
| delete   | `module.gh_oidc_roles.aws_iam_role.this[0]`                        |
| recreate | `module.vpc.aws_network_acl_rule.block_rdp[0]`                     |
|          | `module.vpc.aws_network_acl_rule.block_ssh[0]`                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gh_oidc_roles.aws_iam_role.this[0] will be destroyed
  # (because resource does not use count)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::127893201980:role/OIDCGithubWorkflowRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "token.actions.githubusercontent.com:sub" = "repo:cds-snc/scan-files:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::127893201980:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-07-12T16:51:43Z" -> null
      - force_detach_policies = false -> null
      - id                    = "OIDCGithubWorkflowRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "OIDCGithubWorkflowRole" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "scan-files-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "scan-files-staging"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROAR3RYHMQ6ALTMBO5WU" -> null

      - inline_policy {}
    }

  # module.gh_oidc_roles.aws_iam_role.this["OIDCGithubWorkflowRole"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:cds-snc/scan-files:*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::127893201980:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "OIDCGithubWorkflowRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.vpc.aws_network_acl_rule.block_rdp[0] must be replaced
-/+ resource "aws_network_acl_rule" "block_rdp" {
      ~ cidr_block     = "10.0.0.0/16" -> "0.0.0.0/0" # forces replacement
      ~ id             = "nacl-617173453" -> (known after apply)
      ~ protocol       = "6" -> "tcp"
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_network_acl_rule.block_ssh[0] must be replaced
-/+ resource "aws_network_acl_rule" "block_ssh" {
      ~ cidr_block     = "10.0.0.0/16" -> "0.0.0.0/0" # forces replacement
      ~ id             = "nacl-3211533730" -> (known after apply)
      ~ protocol       = "6" -> "tcp"
        # (6 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 12 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sts"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_ip_set.ip_allowlist"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

26 tests, 17 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
